Ran Plan for project: `prod` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.state_machine_target is tainted, so must be replaced
-/+ resource "aws_cloudwatch_event_target" "state_machine_target" {
      ~ id             = "anime_workflow_schedule-StepFunctionStateMachine" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.eventbridge_policy will be created
+ resource "aws_iam_policy" "eventbridge_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Event to start Step Functions executions"
      + id               = (known after apply)
      + name             = "eventbridge_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "states:StartExecution"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:us-east-2:851725522400:stateMachine:anime_workflow"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.step_functions_policy will be created
+ resource "aws_iam_policy" "step_functions_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Step Functions to invoke Lambda functions"
      + id               = (known after apply)
      + name             = "anime_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                          + "lambda:InvokeAsync",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:us-east-2:851725522400:function:fetch_rss",
                          + "arn:aws:lambda:us-east-2:851725522400:function:process_content",
                          + "arn:aws:lambda:us-east-2:851725522400:function:store_data",
                          + "arn:aws:lambda:us-east-2:851725522400:function:render_video",
                          + "arn:aws:lambda:us-east-2:851725522400:function:save_video",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eventbridge_step_functions_role"
    }

  # aws_iam_role_policy_attachment.attach_step_functions_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_step_functions_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_step_functions_role"
    }

Plan: 5 to add, 0 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252Fsocialmedia_automation%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 5 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```